src/main/resources/services/cancelStopBT.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://www.bottomline.com/webseries/schema/external/message/checkmgmt/v1" xmlns:v11="http://www.bottomline.com/webseries/schema/ps/message/common/v1" xmlns:v12="http://www.bottomline.com/webseries/schema/ps/platform/authentication/v1" xmlns:v13="http://www.bottomline.com/webseries/schema/ps/platform/common/v1" xmlns:v14="http://www.bottomline.com/webseries/schema/ps/platform/checkmgmt/v1" xmlns:v15="http://www.bottomline.com/webseries/schema/ps/platform/entitlements/v1" xmlns:v16="http://www.bottomline.com/webseries/schema/ps/platform/account/v1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:placeStopRequest>
         <v1:requestHeader>
            <v11:requestId>?</v11:requestId>
            <!--Optional:-->
            <v11:requestUser>
               <v12:userId>?</v12:userId>
               <v12:data>
                  <!--Zero or more repetitions:-->
                  <v13:item>
                     <v13:name>?</v13:name>
                     <v13:value>?</v13:value>
                  </v13:item>
               </v12:data>
            </v11:requestUser>
            <!--Optional:-->
            <v11:channelId>?</v11:channelId>
            <!--Optional:-->
            <v11:routingContext>?</v11:routingContext>
         </v1:requestHeader>
         <v1:checkEntryId>
            <v13:TNum>?</v13:TNum>
            <!--Optional:-->
            <v13:updateCount>?</v13:updateCount>
            <v13:productCode>?</v13:productCode>
            <v13:functionCode>?</v13:functionCode>
            <v13:typeCode>?</v13:typeCode>
         </v1:checkEntryId>
         <!--Optional:-->
         <v1:stopReason>?</v1:stopReason>
         <v1:stopDuration>?</v1:stopDuration>
         <v14:accountData v15:provisioningAction="?">
            <!--Optional:-->
            <v16:accountNumber>?</v16:accountNumber>
            <!--Optional:-->
            <v16:bankCode>?</v16:bankCode>
            <!--Optional:-->
            <v16:userGroupId>?</v16:userGroupId>
            <!--Optional:-->
            <v16:accountName>?</v16:accountName>
            <!--Optional:-->
            <v16:clientAccountName>?</v16:clientAccountName>
            <!--Optional:-->
            <v16:currencyCode>?</v16:currencyCode>
            <!--Optional:-->
            <v16:accountType>?</v16:accountType>
            <!--Optional:-->
            <v16:accountState>?</v16:accountState>
            <!--Optional:-->
            <v16:accountSubType>?</v16:accountSubType>
            <!--Optional:-->
            <v16:bankName>?</v16:bankName>
            <!--Optional:-->
            <v16:billingAccount>
               <!--Optional:-->
               <v13:accountNumber>?</v13:accountNumber>
               <!--Optional:-->
               <v13:bankCode>?</v13:bankCode>
            </v16:billingAccount>
            <!--Optional:-->
            <v16:subAccountNumber>?</v16:subAccountNumber>
            <!--Optional:-->
            <v16:tieredLoanType>?</v16:tieredLoanType>
            <!--Optional:-->
            <v16:hostKey>?</v16:hostKey>
            <!--Optional:-->
            <v16:hostPIN>?</v16:hostPIN>
            <!--Optional:-->
            <v16:bankDefinedField1>?</v16:bankDefinedField1>
            <!--Optional:-->
            <v16:bankDefinedField2>?</v16:bankDefinedField2>
            <!--Optional:-->
            <v16:bankDefinedField3>?</v16:bankDefinedField3>
            <!--Optional:-->
            <v16:bankDefinedField4>?</v16:bankDefinedField4>
            <!--Optional:-->
            <v16:bankDefinedField5>?</v16:bankDefinedField5>
            <!--Optional:-->
            <v16:bankDefinedField6>?</v16:bankDefinedField6>
            <!--Optional:-->
            <v16:bankDefinedField7>?</v16:bankDefinedField7>
            <!--Optional:-->
            <v16:bankDefinedField8>?</v16:bankDefinedField8>
            <!--Optional:-->
            <v16:bankDefinedField9>?</v16:bankDefinedField9>
            <!--Optional:-->
            <v16:bankDefinedField10>?</v16:bankDefinedField10>
            <!--Optional:-->
            <v16:BIC>?</v16:BIC>
            <!--Optional:-->
            <v16:ABA>?</v16:ABA>
            <!--Zero or more repetitions:-->
            <v16:imageAccessSetting>?</v16:imageAccessSetting>
            <!--Zero or more repetitions:-->
            <v16:settings>
               <v13:name>?</v13:name>
               <v13:value>?</v13:value>
            </v16:settings>
            <!--Zero or more repetitions:-->
            <v16:productSettings>
               <v13:productCode>?</v13:productCode>
               <!--Zero or more repetitions:-->
               <v13:settings>
                  <v13:name>?</v13:name>
                  <v13:value>?</v13:value>
               </v13:settings>
            </v16:productSettings>
         </v14:accountData>
         <v14:serialNumber>?</v14:serialNumber>
         <!--Optional:-->
         <v14:serialNumberTo>?</v14:serialNumberTo>
         <!--Optional:-->
         <v14:amount>?</v14:amount>
         <!--Optional:-->
         <v14:checkIssueDate>?</v14:checkIssueDate>
         <!--Optional:-->
         <v14:payeeName>?</v14:payeeName>
         <!--Optional:-->
         <v14:memo>?</v14:memo>
         <!--Optional:-->
         <v14:sequenceNumber>?</v14:sequenceNumber>
         <!--Zero or more repetitions:-->
         <v14:additionalData>
            <v13:name>?</v13:name>
            <v13:value>?</v13:value>
         </v14:additionalData>
         <!--Zero or more repetitions:-->
         <v14:stopIds>
            <v13:name>?</v13:name>
            <v13:value>?</v13:value>
         </v14:stopIds>
      </v1:placeStopRequest>
   </soapenv:Body>
</soapenv:Envelope>